tutorials/combustion/XiDyMFoam/oscillatingCylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev-OpenCFD.feature-periodicAMIAndXiDyMFoam|
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inletAir
    {
        type            patch;
        nFaces          16;
        startFace       5952;
    }
    inletFuel
    {
        type            patch;
        nFaces          8;
        startFace       5968;
    }
    outlet
    {
        type            patch;
        nFaces          24;
        startFace       5976;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       6000;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       6240;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6144;
        startFace       6336;
    }
)

// ************************************************************************* //
